Revit 2027 API
AdvancedLayered.LayeredRotation Property
 The property labeled "Rotation" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string LayeredRotation { get; }
Public Shared ReadOnly Property LayeredRotation As String
	Get
public:
static property String^ LayeredRotation {
	String^ get ();
}
static member LayeredRotation : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble". This property allows a connected asset.
See Also
Reference
AdvancedLayered Class
Autodesk.Revit.DB.Visual Namespace